Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 120
      arrivalRate: 50
      name: "Sustained baseline load"
  defaults:
    headers:
      content-type: "application/json"

scenarios:
  - name: "API Performance Simulation"
    flow:
      - get:
          url: "/health"
      - post:
          url: "/api/ai/recommendation"
          json:
            symptoms: ["Headache", "Fatigue"]
            duration: "3 days"
